void Mission() {
  // set_line_center(0);        // เดินธรรมดา เข้ากลางหุ่น
  set_line_center(1);           // เดินตามเส้น เข้ากลางหุ่น
  set_kp_kd_slow(0.008, 0.08);  // PID ช่วงช้า


  set_position_line(3500);  // 0–7000 | 1500=ซ้าย 3500=กลาง 5500=ขวา
  TrackLineColor(0);        // 0 = พื้นขาวเส้นดำ | 1 = พื้นดำเส้นขาว
  //TestMotor(); //คำสั่งทดสอบมอเตอร์ โดยหมุนซ้ายไปข้างหน้าก่อน แล้วค่อยหมุนขวาไปข้างหน้า
  ModeSpdPID(0, 100, -5);
  // ModeSpdPID(1, 100, -100); //โหมด PID แบบปกติ
  // ModeSpdPID(2, 60, -60); //โค้งเยอะๆ
  // ModeSpdPID(3, 100, -50); //โหมดคิดเอง
  // ModeSpdPID(4, 100, 0); //โหมด PID แบบปกติ

  // // >>________เขียนโค้ดหลังจากบรรทัดนี้________________<<<<
  // for (int i = 0; i <= 10; i++) {
  //   FFcm(60, 120, 'r');
  //   // MotorStop(300);
  //   // BBcm(30,70,'c');
  //   FFcm(60, 120, 'c');
  //   MotorStop(300);
  //   BBcm(40, 100, 'l');

  //   BBcm(40, 100, 'r');
  //   rotate_left(20,95,10);
  //   MotorStop(200);
  //   // rotate_left(20,180);
  // }


}  //_________________ห้ามลบ__________________________

/* */