#include <MyRP_Pico2.h>
MyRP_Pico2 robot;

#include <MyRP_PICO2_CHEA2.h>


//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
int servo_down = 60;    //-------------------->> ตั้งค่า มื่อจับลงขนานกับพื้น
int servoL_open = 120;  //-------------------->> ตั้งค่า กางฝ่ามือด้านซ้าย
int servoR_open = 120;  //-------------------->> ตั้งค่า กางฝ่ามือด้านขวา
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ
//----------------------------------------------------------------------------->> ตั้งค่ามือจับ

void setup() {
  robot.begin();
  set_motor();
  // robot.sw();
  //------------------------------- ตั้งค่าโค้ดครูอิงค์ -------------------------
  _setting();
  RobotSetup();
  //---------------------------------------------------------------------

  robot.servoTrim(0, 0, 0, 0);  //servoTrim(s0, s1, s10, s28);

  arm_up_open();
  // arm_down_open();
  // arm_up_close();

  // robot.sw();
  OK();
  //SetUpServoSerialCommand();  //ตั้งค่า Servo ผ่าน Serial

  // >>________เขียนโค้ดหลังจากบรรทัดนี้________________<<<<



  Mission();



}  //_________________ห้ามลบ__________________________

void loop() {
  MotorStop(200);
}
